10101kin/CodeArch-Tracing/codegen_outputs/Migrate_iLLD_TC387_ADS_QSPI_TLE9180D_2_to_iLLD_TC4_r_20260323_101004/attempt_003_mock/IfxXspi_Spi.h
#ifndef IFXXSPI_SPI_H
#define IFXXSPI_SPI_H

#include "illd_types/Ifx_Types.h"  /* REQUIRED for uint8, uint16, uint32, boolean, float32 types */

/* ============= Type Definitions ============= */
/* Ifx_XSPI - defined in Ifx_Types.h */          
typedef struct IfxXspi_Spi IfxXspi_Spi;    
typedef struct IfxXspi_Spi_GpioPins IfxXspi_Spi_GpioPins;
typedef struct IfxXspi_Spi_CpuJobConfig IfxXspi_Spi_CpuJobConfig;
typedef struct IfxXspi_Spi_Config IfxXspi_Spi_Config;
typedef struct IfxXspi_Spi_initTransferConfig IfxXspi_Spi_initTransferConfig;
typedef enum IfxXspi_Status IfxXspi_Status;

/* Forward declarations for XSPI driver types (from real iLLD) */
/* Production API prototypes to mock */
/* Mock control: Get call counts */
/* Mock control: Set return values */
/* Reset all counters and captured values */

/* ============= Function Declarations ============= */
void IfxXspi_Spi_transferInit(Ifx_XSPI *xspi, IfxXspi_Spi_initTransferConfig *config);
void IfxXspi_Spi_setXspiGpioPins(Ifx_XSPI *xspi, IfxXspi_Spi_GpioPins *pins);
boolean IfxXspi_Spi_exchange(IfxXspi_Spi *xspi, IfxXspi_Spi_CpuJobConfig *jobConfig);
uint32 IfxXspi_Spi_isrReceive(IfxXspi_Spi *xspi);
void IfxXspi_Spi_isrTransmit(IfxXspi_Spi *xspi);
uint32 IfxXspi_Spi_isrDmaReceive(IfxXspi_Spi *xspi);
IfxXspi_Status IfxXspi_Spi_initModule(IfxXspi_Spi *xspi, const IfxXspi_Spi_Config *config);
void IfxXspi_Spi_initModuleConfig(IfxXspi_Spi_Config *config, Ifx_XSPI *xspi);
uint32 IfxXspi_Spi_Mock_GetCallCount_transferInit(void);
uint32 IfxXspi_Spi_Mock_GetCallCount_setXspiGpioPins(void);
uint32 IfxXspi_Spi_Mock_GetCallCount_exchange(void);
uint32 IfxXspi_Spi_Mock_GetCallCount_isrReceive(void);
uint32 IfxXspi_Spi_Mock_GetCallCount_isrTransmit(void);
uint32 IfxXspi_Spi_Mock_GetCallCount_isrDmaReceive(void);
uint32 IfxXspi_Spi_Mock_GetCallCount_initModule(void);
uint32 IfxXspi_Spi_Mock_GetCallCount_initModuleConfig(void);
void IfxXspi_Spi_Mock_SetReturn_exchange(boolean value);
void IfxXspi_Spi_Mock_SetReturn_isrReceive(uint32 value);
void IfxXspi_Spi_Mock_SetReturn_isrDmaReceive(uint32 value);
void IfxXspi_Spi_Mock_SetReturn_initModule(IfxXspi_Status value);
void IfxXspi_Spi_Mock_Reset(void);

#endif